RZomerman/ST-SA3ES-Internet-Streamer-Conversion/controller/sdkconfig.defaults
# ESP-IDF SDK Configuration

# Board and chip
CONFIG_IDF_TARGET="esp32s3"
CONFIG_IDF_TARGET_ESP32S3=y

# FreeRTOS
CONFIG_FREERTOS_MAX_TASK_NAME_LEN=32

# Logging
CONFIG_LOG_DEFAULT_LEVEL=3
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# Serial
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_USB_SERIAL_JTAG=y

# Timer
CONFIG_ESP_TIMER_IMPL_SYSTIMER=y

# GPIO
CONFIG_GPIO_CTRL_FUNC_IN_IRAM=y

# Driver
CONFIG_RMT_ENABLE_BY_DEFAULT=y

# Performance tuning
CONFIG_FREERTOS_TICK_RATE_HZ=1000

# Watchdog
CONFIG_TASK_WDT_ENABLE=y
CONFIG_TASK_WDT_TIMEOUT_S=15

# NVS
CONFIG_NVS_ENCRYPTION=n
